tutorials/incompressible/MRFSimpleFoam/mixerVessel2D/system/faceSetDict_rotorFaces
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      faceSetDict_rotorFaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

name            rotor;

action          new;

topoSetSources  ( cellToFace { set rotor ; option all ; } );

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
